In [1]:
# Dict student add
# Emp student add
# kbc game

In [2]:
data = {'Name':[],
       'Class':[],
       'Age':[],
       'Sec':[],
       'Address':[]}

data

{'Name': [], 'Class': [], 'Age': [], 'Sec': [], 'Address': []}

In [8]:
# nested loop

for i in range(3):
    for j in data:
        user = input(f'Enter your {j}: ')
        data[j].append(user)
        
    print(f'{i+1} Student Added successfully!!')

Enter your Name: Akshay
Enter your Class: 5
Enter your Age: 25
Enter your Sec: A
Enter your Address: Noida
1 Student Added successfully!!
Enter your Name: Vippin
Enter your Class: 12
Enter your Age: 23
Enter your Sec: B
Enter your Address: Delhi
2 Student Added successfully!!
Enter your Name: Karan
Enter your Class: 11
Enter your Age: 20
Enter your Sec: A
Enter your Address: Faridabad
3 Student Added successfully!!

In [6]:
# for j in data:
#     print(j,data[j])

In [9]:
data

{'Name': ['Akshay', 'Vippin', 'Karan'],
 'Class': ['5', '12', '11'],
 'Age': ['25', '23', '20'],
 'Sec': ['A', 'B', 'A'],
 'Address': ['Noida', 'Delhi', 'Faridabad']}

In [10]:
import pandas as pd

In [12]:
std_table = pd.DataFrame(data)
std_table

     Name Class Age Sec    Address
0  Akshay     5  25   A      Noida
1  Vippin    12  23   B      Delhi
2   Karan    11  20   A  Faridabad

In [14]:
print(std_table)

     Name Class Age Sec    Address
0  Akshay     5  25   A      Noida
1  Vippin    12  23   B      Delhi
2   Karan    11  20   A  Faridabad

In [15]:
std_table

     Name Class Age Sec    Address
0  Akshay     5  25   A      Noida
1  Vippin    12  23   B      Delhi
2   Karan    11  20   A  Faridabad

In [18]:
std_table.to_excel(r"C:\Users\Lenovo\Desktop\sandeep.xlsx")
print('done')

done

In [19]:
[input('Enter name: ') for i in range(3)]

Enter name: ajay
Enter name: karan
Enter name: mohan

['ajay', 'karan', 'mohan']

In [20]:
data = {'Name':[input('Enter your name: ') for i in range(3)],
       'Class':[input('Enter your Class: ') for i in range(3)],
       'Age':[input('Enter your Age: ') for i in range(3)],
       'Sec':[input('Enter your Sec: ') for i in range(3)],
       'Address':[input('Enter your Address: ') for i in range(3)]}

Enter your name: Ajay
Enter your name: Mohan
Enter your name: Karan
Enter your Class: 12
Enter your Class: 11
Enter your Class: 10
Enter your Age: 12
Enter your Age: 11
Enter your Age: 10
Enter your Sec: A
Enter your Sec: B
Enter your Sec: A
Enter your Address: Noida
Enter your Address: Delhi
Enter your Address: Noida

In [21]:
data

{'Name': ['Ajay', 'Mohan', 'Karan'],
 'Class': ['12', '11', '10'],
 'Age': ['12', '11', '10'],
 'Sec': ['A', 'B', 'A'],
 'Address': ['Noida', 'Delhi', 'Noida']}

In [22]:
pd.DataFrame(data)

    Name Class Age Sec Address
0   Ajay    12  12   A   Noida
1  Mohan    11  11   B   Delhi
2  Karan    10  10   A   Noida

In [24]:
print(list(range(1,100)))

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99]

In [43]:
import random
random.seed(10)
a = [random.randint(1,10000001) for i in range(1,11)]
print(a)

[9586545, 546687, 7195565, 8096042, 9698763, 248848, 3457755, 7760814, 8242587, 4656025]

In [44]:
# KBC GAME

In [73]:
questions = ['Which of the following is the capital of Arunachal Pradesh?',
            'What are the major languages spoken in Andhra Pradesh?',
            'What is the state flower of Haryana?']


options = [['Itanagar','Dispur','Imphal','Panaji'],
          ['Odia and Telugu','Telugu and Urdu','Telugu and Kannada','All of the above languages'],
          ['Lotus','Rhododendron','Golden Shower','Not Declared']]


correct_op = ['A','B','A']


op = 'ABCD'
print('Welcome to KBC'.center(123,' '))

for index,value in enumerate(questions):
    print(f'Q{index+1}: {value}')
    
    for i,j in enumerate(options[index]):
        print(f'  {op[i]}: {j}')
        
    user = input('Enter your choice: ').upper()
    if user == correct_op[index]:
        print('Right Answer!!')
    else:
        print('Wrong Answer!!')
        break
    print()
    
else:
    print('You Won 7 crore!!')

                                                       Welcome to KBC
Q1: Which of the following is the capital of Arunachal Pradesh?
  A: Itanagar
  B: Dispur
  C: Imphal
  D: Panaji
Enter your choice: a
Right Answer!!

Q2: What are the major languages spoken in Andhra Pradesh?
  A: Odia and Telugu
  B: Telugu and Urdu
  C: Telugu and Kannada
  D: All of the above languages
Enter your choice: d
Wrong Answer!!